In [5]:
#7-1處理缺失數據
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data[0] = None
data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
#濾除缺失數據
from numpy import nan as NA
data2 = pd.Series([1, NA, 3.5, NA, 7])
data2

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [9]:
data2.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data2[data2.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1, 6.5, 3], [1, NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()     #丟棄所有含NA的行
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')     #丟棄全為NA的行

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
data.dropna(axis=1)    #丟棄所有含NA的列

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [18]:
data.dropna(axis=1, how='all')    #丟棄全為NA的列

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [49]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.346941       NaN       NaN
1  1.002250       NaN       NaN
2 -0.029272       NaN  0.955347
3 -0.352056       NaN -1.368020
4 -0.331622  1.821422 -0.691931
5 -0.627419 -0.325353  0.698741
6 -0.831491 -0.264588  0.680341

In [20]:
df.dropna()

          0         1         2
4 -0.183790  0.791834 -0.727004
5  0.370076 -0.846782  0.173543
6  0.434433  0.321542 -1.324456

In [50]:
df.dropna(thresh=2)    #保留至少有2個非空值的行

          0         1         2
2 -0.029272       NaN  0.955347
3 -0.352056       NaN -1.368020
4 -0.331622  1.821422 -0.691931
5 -0.627419 -0.325353  0.698741
6 -0.831491 -0.264588  0.680341

In [52]:
df.fillna(1)     #用1填補缺失值

          0         1         2
0 -1.346941  1.000000  1.000000
1  1.002250  1.000000  1.000000
2 -0.029272  1.000000  0.955347
3 -0.352056  1.000000 -1.368020
4 -0.331622  1.821422 -0.691931
5 -0.627419 -0.325353  0.698741
6 -0.831491 -0.264588  0.680341

In [53]:
df.fillna({0: 1, 1: 0.7, 2: 8})    #指定每列缺失值要填補的數字

          0         1         2
0 -1.346941  0.700000  8.000000
1  1.002250  0.700000  8.000000
2 -0.029272  0.700000  0.955347
3 -0.352056  0.700000 -1.368020
4 -0.331622  1.821422 -0.691931
5 -0.627419 -0.325353  0.698741
6 -0.831491 -0.264588  0.680341

In [56]:
_ = df.fillna(7, inplace=True)     #不需要還原就可以填補別的數字
df

          0         1         2
0 -1.346941  7.000000  7.000000
1  1.002250  7.000000  7.000000
2 -0.029272  7.000000  0.955347
3 -0.352056  7.000000 -1.368020
4 -0.331622  1.821422 -0.691931
5 -0.627419 -0.325353  0.698741
6 -0.831491 -0.264588  0.680341

In [57]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.717566  1.591056 -0.039945
1  0.608951  0.522761  0.291343
2  1.104895       NaN  0.339630
3  0.782872       NaN  0.467490
4 -0.260122       NaN       NaN
5 -0.644233       NaN       NaN

In [58]:
df.fillna(method='ffill')     #行數據向下填充

          0         1         2
0  0.717566  1.591056 -0.039945
1  0.608951  0.522761  0.291343
2  1.104895  0.522761  0.339630
3  0.782872  0.522761  0.467490
4 -0.260122  0.522761  0.467490
5 -0.644233  0.522761  0.467490

In [59]:
df.fillna(method='ffill', limit=1)     #行數據向下填充一行

          0         1         2
0  0.717566  1.591056 -0.039945
1  0.608951  0.522761  0.291343
2  1.104895  0.522761  0.339630
3  0.782872       NaN  0.467490
4 -0.260122       NaN  0.467490
5 -0.644233       NaN       NaN

In [60]:
df.fillna(method='ffill', axis=1)     #列數據向右填充

          0         1         2
0  0.717566  1.591056 -0.039945
1  0.608951  0.522761  0.291343
2  1.104895  1.104895  0.339630
3  0.782872  0.782872  0.467490
4 -0.260122 -0.260122 -0.260122
5 -0.644233 -0.644233 -0.644233

In [61]:
df.fillna(method='ffill', axis=1, limit=1)     #列數據向右填充一列

          0         1         2
0  0.717566  1.591056 -0.039945
1  0.608951  0.522761  0.291343
2  1.104895  1.104895  0.339630
3  0.782872  0.782872  0.467490
4 -0.260122 -0.260122       NaN
5 -0.644233 -0.644233       NaN

In [62]:
data = pd.Series([1, NA, 3.5, NA, 7])     #可用統計數據做為填充的值
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [68]:
#7-2數據轉換
#移除重複數據
data = pd.DataFrame({'k1': ['one', 'two'] *3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [64]:
data.duplicated()    #看每行是否與前一行重複

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [65]:
data.drop_duplicates()     #丟棄與前一行重複的行

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [70]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

In [71]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [72]:
data.drop_duplicates(['k1', 'k2'], keep='last')    #指定兩列要同時重複才丟棄，保留重複的最後一行

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [73]:
#利用映射進行數據轉換
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [74]:
#不同肉類到動物的映射
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [75]:
lowercased = data['food'].str.lower()    #先解決food中大小寫不一，一律改為小寫
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [76]:
data['animal'] = lowercased.map(meat_to_animal)    #用map新增映射的列
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [77]:
data['food'].map(lambda x: meat_to_animal[x.lower()])    #一次完成上述指令

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [78]:
#替換值
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [80]:
data.replace(-999, np.nan)     #因為-999可能是缺失值的標記，因此將其替換成pandas的NA值

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [81]:
data.replace([-999, -1000], np.nan)    #replace可同時替換多個數值

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [82]:
data.replace([-999, -1000], [np.nan, 0])    #也可將不同數值分別表示

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [83]:
data.replace({-999: np.nan, -1000: 0})    #參數也可以是字典

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [84]:
#重新命名標籤軸
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [85]:
transform = lambda x: x[:4].upper()    #只取軸的前四位
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [86]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [87]:
data.rename(index=str.title, columns=str.upper)    #轉換標籤軸

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [88]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})    #rename也可針對部分標籤作轉換

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [93]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [95]:
#離散化和面元劃分
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)     #數列中的年齡屬於哪個年齡組
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [96]:
pd.value_counts(cats)    #看每個區間包含多少數值

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [97]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)    #改變括號閉端方向（預設是開右邊）

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [100]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)     #labels長度需與bins相同

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [101]:
data = np.random.rand(20)
data

array([0.47463629, 0.69287857, 0.77538486, 0.16777634, 0.34698874,
       0.21355067, 0.39710659, 0.21606972, 0.88528774, 0.83971551,
       0.7522077 , 0.67410197, 0.59069928, 0.64721657, 0.70536338,
       0.04493974, 0.72425117, 0.74315272, 0.01968047, 0.63785258])

In [106]:
a = pd.cut(data, 4, precision=2)    #precision=2表示取兩位小數，當不限定區間，只限組數，會根據data最大與最小值計算等長的區間
a

[(0.45, 0.67], (0.67, 0.89], (0.67, 0.89], (0.019, 0.24], (0.24, 0.45], ..., (0.019, 0.24], (0.67, 0.89], (0.67, 0.89], (0.019, 0.24], (0.45, 0.67]]
Length: 20
Categories (4, interval[float64, right]): [(0.019, 0.24] < (0.24, 0.45] < (0.45, 0.67] <
                                           (0.67, 0.89]]

In [107]:
pd.value_counts(a)

(0.67, 0.89]     9
(0.019, 0.24]    5
(0.45, 0.67]     4
(0.24, 0.45]     2
dtype: int64

In [108]:
b = pd.qcut(data, 4, precision=2)
b

[(0.31, 0.64], (0.64, 0.73], (0.73, 0.89], (0.01, 0.31], (0.31, 0.64], ..., (0.01, 0.31], (0.64, 0.73], (0.73, 0.89], (0.01, 0.31], (0.31, 0.64]]
Length: 20
Categories (4, interval[float64, right]): [(0.01, 0.31] < (0.31, 0.64] < (0.64, 0.73] <
                                           (0.73, 0.89]]

In [109]:
#qcut會讓每個區間有相同數量的數據
pd.value_counts(b)

(0.01, 0.31]    5
(0.31, 0.64]    5
(0.64, 0.73]    5
(0.73, 0.89]    5
dtype: int64

In [110]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])    #qcut自訂值是分位數

[(0.155, 0.643], (0.643, 0.782], (0.643, 0.782], (0.155, 0.643], (0.155, 0.643], ..., (0.018699999999999998, 0.155], (0.643, 0.782], (0.643, 0.782], (0.018699999999999998, 0.155], (0.155, 0.643]]
Length: 20
Categories (4, interval[float64, right]): [(0.018699999999999998, 0.155] < (0.155, 0.643] < (0.643, 0.782] <
                                           (0.782, 0.885]]

In [112]:
#檢測和過濾異常值
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -1.475359 -0.669423  2.872234  1.202460
1    0.248795 -0.610426 -0.153003  1.047495
2   -0.629694 -0.007116  0.461717 -0.459420
3    0.304409  0.542970 -0.475436 -0.612602
4   -0.189254 -1.049994 -1.483304 -0.029992
..        ...       ...       ...       ...
995  0.546019 -1.408007  0.013173 -1.363671
996 -0.554322  1.018803 -2.213546  0.233383
997  1.343290 -2.062024 -0.003856  0.894266
998 -0.379036 -0.830983  1.257519 -0.580105
999  1.667901  0.462420 -1.408662  0.384088

[1000 rows x 4 columns]

In [113]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.007275    -0.008842     0.006056    -0.029668
std       0.993946     1.005861     0.987322     0.991923
min      -2.974738    -3.370762    -3.043621    -3.509834
25%      -0.654228    -0.650774    -0.682625    -0.713306
50%      -0.020777     0.040647     0.042640    -0.039804
75%       0.691168     0.646817     0.680240     0.658158
max       3.398718     3.294282     3.297198     3.262243

In [114]:
col = data[2]
col[np.abs(col) > 3]    #想找出每列中絕對值大小超過3的值

602    3.297198
862   -3.043621
Name: 2, dtype: float64

In [119]:
data[(np.abs(data) > 3).any(1)]    #選出所有含有絕對值超過3的行

            0         1         2         3
29   3.398718 -1.575244  0.973776 -0.582891
205  1.236794 -3.370762  0.097723  0.696503
374  0.609535 -0.640309  0.616804  3.262243
602  0.130809 -1.654379  3.297198  0.356330
740 -0.622137 -3.099355 -0.028701  1.430215
770 -0.869809 -0.580998  0.872716 -3.509834
855  1.438436  3.294282  1.854042  1.158263
862  1.914715 -0.162814 -3.043621 -0.333345
877  0.467852 -0.150655 -0.771534 -3.322504
892  3.083409 -1.209099 -1.054305  0.981611
911  3.030733  0.487798  1.390353  0.192058

In [120]:
data[np.abs(data) > 3] = np.sign(data) * 3    #將數據限制在3,-3以內，np.sign(data)是1,-1
data

            0         1         2         3
0   -1.475359 -0.669423  2.872234  1.202460
1    0.248795 -0.610426 -0.153003  1.047495
2   -0.629694 -0.007116  0.461717 -0.459420
3    0.304409  0.542970 -0.475436 -0.612602
4   -0.189254 -1.049994 -1.483304 -0.029992
..        ...       ...       ...       ...
995  0.546019 -1.408007  0.013173 -1.363671
996 -0.554322  1.018803 -2.213546  0.233383
997  1.343290 -2.062024 -0.003856  0.894266
998 -0.379036 -0.830983  1.257519 -0.580105
999  1.667901  0.462420 -1.408662  0.384088

[1000 rows x 4 columns]

In [121]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.006762    -0.008666     0.005802    -0.029098
std       0.992315     1.003461     0.986241     0.988401
min      -2.974738    -3.000000    -3.000000    -3.000000
25%      -0.654228    -0.650774    -0.682625    -0.713306
50%      -0.020777     0.040647     0.042640    -0.039804
75%       0.691168     0.646817     0.680240     0.658158
max       3.000000     3.000000     3.000000     3.000000

In [122]:
#排列和隨機採樣
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [123]:
sampler = np.random.permutation(5)    #隨機重排序
sampler

array([4, 0, 2, 3, 1])

In [124]:
df.take(sampler)    #將df的行按sampler進行重新排序

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7

In [125]:
df.sample(n=4)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
4  16  17  18  19

In [126]:
#透過替換的方式產生樣本，且允許重複選擇()
choices = pd.Series([5, 7, -1, 6, 4])
choices

0    5
1    7
2   -1
3    6
4    4
dtype: int64

In [129]:
draws = choices.sample(n=10, replace=True)
draws

4    4
4    4
0    5
1    7
2   -1
2   -1
3    6
2   -1
1    7
4    4
dtype: int64

In [130]:
#計算指標/啞變量
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [131]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [132]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [134]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [135]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [136]:
#7-3字符串
val = 'a,b,  guido'
val.split(',')    #以逗號分隔的字串可以用split拆成數段

['a', 'b', '  guido']

In [137]:
pieces = [x.strip() for x in val.split(',')]    #split和strip可一起使用，以同時去除空白符或換行
pieces

['a', 'b', 'guido']

In [139]:
first, second, third = pieces
first + '::' + second + '::' + third    #可以將字串用不同符號連接

'a::b::guido'

In [140]:
#較常用
'::'.join(pieces)

'a::b::guido'

In [142]:
'guido' in val

True

In [143]:
val.index(',')

1

In [144]:
val.index(':')    #index找不到的字串會顯示error

<class 'ValueError'>: substring not found

In [145]:
val.find(',')

1

In [146]:
val.find(':')    #find找不到的字串會返回-1

-1

In [147]:
val.count(',')    #count可以顯示指定字串出現的次數

2

In [148]:
val.replace(',', '::')    #replace用於將指定元素做替換

'a::b::  guido'

In [151]:
val.replace(',', '')    #也可用於刪除

'ab  guido'

In [152]:
#正則表達式
import re
text = "foo    bar\t baz  \tqux"
text

'foo    bar\t baz  \tqux'

In [153]:
re.split('\s+', text)    #可用來辨識各種不同空格或換行，拆分字符串

['foo', 'bar', 'baz', 'qux']

In [157]:
regex = re.compile('\s+')     #對CPU較省時
regex.split(text)     #藉由regex分割

['foo', 'bar', 'baz', 'qux']

In [156]:
regex.findall(text)     #找到字串中的regex

['    ', '\t ', '  \t']

In [158]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex = re.compile(pattern, flags=re.IGNORECASE)
#findall是找所有匹配項
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [159]:
#search是找第一個匹配項
m = regex.search(text)
m

In [161]:
print(regex.match(text))

None

In [162]:
#sub可以替換指定字串為新字串
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [164]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [165]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [ ]:
#可以給予各項分組類別名稱
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

In [166]:
#pandas的向量化字符串函數（當字串中有缺失值）
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [167]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [168]:
#藉由str.contains檢查每項是否含有特定字串（存在NA會報錯）
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [169]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [170]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [173]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [178]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object